Realeed/Silabs_BTMesh/EFR32xG24_btmesh_lighting_client/gecko_sdk_4.4.1/platform/service/sleeptimer/src/sl_sleeptimer.c
  return SL_STATUS_OK;
}

/*******************************************************************************
 * Convert a 32 bit time stamp into a date structure.
 ******************************************************************************/
sl_status_t sl_sleeptimer_convert_time_to_date(sl_sleeptimer_timestamp_t time,
                                               sl_sleeptimer_time_zone_offset_t time_zone,
                                               sl_sleeptimer_date_t *date)
{
  // convert 32 bit timestamp to 64 bit
  sl_sleeptimer_timestamp_64_t temp_time = (uint64_t)time + TIME_64_TO_32_EPOCH_OFFSET_SEC;
  sl_status_t err_code = sl_sleeptimer_convert_time_to_date_64(temp_time, time_zone, date);
  return err_code;
}

/*******************************************************************************
 * Convert a 64 bit time stamp into a date structure.
 ******************************************************************************/
sl_status_t sl_sleeptimer_convert_time_to_date_64(sl_sleeptimer_timestamp_64_t time,
                                                  sl_sleeptimer_time_zone_offset_t time_zone,
                                                  sl_sleeptimer_date_t *date)
{
  uint16_t full_year = 0;
  uint16_t leap_day = 0;
  uint8_t leap_year_flag = 0;
  uint8_t current_month = 0;

  if (!is_valid_time_64(time, TIME_FORMAT_UNIX_64_BIT, time_zone)) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  time += time_zone;  // add UTC offset to convert to Standard Time
  date->sec = time % 60;
  time /= 60;
  date->min = time % 60;
  time /= 60;
  date->hour = time % 24;
  time /= 24; // time is now the number of days since 1900

  date->day_of_week = (sl_sleeptimer_weekDay_t)compute_day_of_week_64(time);

  full_year = time / TIME_DAY_PER_YEAR; // Approximates the number of full years
  uint32_t base_year = 1900u;
  uint32_t current_year = full_year + base_year;

  if (full_year > 4) { // 1904 is the first leap year since 1900
    leap_day = number_of_leap_days(base_year, current_year);  // Approximates the number of leap days.
    full_year = (time - leap_day) / TIME_DAY_PER_YEAR; // Computes the number of year integrating the leap days.
    current_year = full_year + base_year;
    leap_day = number_of_leap_days(base_year, current_year); // Computes the actual number of leap days of the previous years.
  }
  date->year = full_year; // Year in date struct must be based on a 1900 epoch.
  if (is_leap_year(date->year)) {
    leap_year_flag = 1;
  }

  time = (time - leap_day) - (TIME_DAY_PER_YEAR * full_year);  // Subtracts days of previous year.
  date->day_of_year = time + 1;

  while (time >= days_in_month[leap_year_flag][current_month]) {
    time -= days_in_month[leap_year_flag][current_month]; // Subtracts the number of days of the passed month.
    current_month++;
  }
  date->month = (sl_sleeptimer_month_t)current_month;
  date->month_day = time + 1;
  date->time_zone = time_zone;

  return SL_STATUS_OK;
}

/*******************************************************************************
 * Convert a date structure into a 32 bit time stamp.
 ******************************************************************************/
sl_status_t sl_sleeptimer_convert_date_to_time(sl_sleeptimer_date_t *date,
                                               sl_sleeptimer_timestamp_t *time)
{
  // Create a 64 bit time stamp
  sl_sleeptimer_timestamp_64_t temp_time =  0;
  sl_status_t err_code = sl_sleeptimer_convert_date_to_time_64(date, &temp_time);

  if (err_code != SL_STATUS_OK) {
    return err_code;
  }
  // Convert 64 bit time to 32 bit time

  sl_sleeptimer_timestamp_64_t time_32 = temp_time;
  time_32 -= TIME_64_TO_32_EPOCH_OFFSET_SEC;
  *time = (time_32 & 0xFFFFFFFF);

  return err_code;
}

/*******************************************************************************
 * Convert a date structure into a 64 bit time stamp.
 ******************************************************************************/
sl_status_t sl_sleeptimer_convert_date_to_time_64(sl_sleeptimer_date_t *date,
                                                  sl_sleeptimer_timestamp_64_t *time)
{
  uint16_t month_days = 0;
  uint8_t  month;
  uint16_t  full_year = 0;
  uint8_t  leap_year_flag = 0;
  uint16_t  leap_days = 0;

  if (!is_valid_date_64(date)) {
    return SL_STATUS_INVALID_PARAMETER;
  }

  full_year = (date->year);                                  // base year for 64 bits its 1900 not 1970
  month = date->month;                              // offset to get months value from 1 to 12.

  uint32_t base_year = 1900u;
  uint32_t current_year = full_year + base_year;

  *time = (full_year * (uint64_t)TIME_SEC_PER_YEAR);

  if (full_year > 4) {                                       // 1904 is the first leap year since 1900
    leap_days = number_of_leap_days(base_year, current_year);
    month_days = leap_days;
  }

  if (is_leap_year(date->year)) {
    leap_year_flag = 1;
  }

  for (int i = 0; i < month; i++) {
    month_days += days_in_month[leap_year_flag][i];         // Add the number of days of the month of the year.
  }

  month_days += (date->month_day - 1);                       // Add full days of the current month.
  *time += month_days * TIME_SEC_PER_DAY;
  *time += (3600 * date->hour) + (60 * date->min) + date->sec;
  *time -= date->time_zone;

  return SL_STATUS_OK;
}

/*******************************************************************************
 * Convert a date structure to string.
 ******************************************************************************/
uint32_t sl_sleeptimer_convert_date_to_str(char *str,
                                           size_t size,
                                           const uint8_t *format,
                                           sl_sleeptimer_date_t *date)
{
  uint32_t  return_size = 0u;
  if (is_valid_date(date)) {
    struct tm date_struct;

    date_struct.tm_hour = date->hour;
    date_struct.tm_mday = date->month_day;
    date_struct.tm_min = date->min;
    date_struct.tm_mon = date->month;
    date_struct.tm_sec = date->sec;
    date_struct.tm_wday = date->day_of_week;
    date_struct.tm_yday = date->day_of_year;
    date_struct.tm_year = date->year;

    return_size = strftime(str,
                           size,
                           (const char *)format,
                           &date_struct);
  }

  return return_size;
}

/***************************************************************************//**
 * Sets time zone offset.
 *
 * @param  offset  Time zone offset, in seconds.
 ******************************************************************************/
void sl_sleeptimer_set_tz(sl_sleeptimer_time_zone_offset_t offset)
{
  CORE_DECLARE_IRQ_STATE;

