Realeed/Silabs_BTMesh/EFR32xG24_btmesh_lighting_client/gecko_sdk_4.4.1/platform/service/sleeptimer/src/sl_sleeptimer.c
/*******************************************************************************
 * Process timer interrupt.
 *
 * @param local_flag Flag indicating the type of timer interrupt.
 ******************************************************************************/
void process_timer_irq(uint8_t local_flag)
{
  CORE_DECLARE_IRQ_STATE;
  if (local_flag & SLEEPTIMER_EVENT_OF) {
#if SL_SLEEPTIMER_WALLCLOCK_CONFIG
    uint32_t timer_freq = sl_sleeptimer_get_timer_frequency();

    overflow_tick_rest += calculated_tick_rest;
    if (overflow_tick_rest >= timer_freq) {
      second_count++;
      overflow_tick_rest -= timer_freq;
    }
    second_count = second_count + calculated_sec_count;
#endif
    overflow_counter++;

    update_delta_list();

    if (timer_head) {
      set_comparator_for_next_timer();
    }
  }

  if (local_flag & SLEEPTIMER_EVENT_COMP) {
    sl_sleeptimer_timer_handle_t *current = NULL;

    uint32_t nb_timer_expire = 0u;
    uint16_t option_flags = 0;

    CORE_ENTER_ATOMIC();
    // Make sure the timers list is up to date with the time elapsed since the last update
    update_delta_list();

    // Process all timers that have expired.
    while ((timer_head) && (timer_head->delta == 0)) {
      sl_sleeptimer_timer_handle_t *temp = timer_head;
      current = timer_head;
      int32_t periodic_correction = 0u;
      int64_t timeout_temp = 0;
      bool skip_remove = false;

      // Process timers with higher priority first
      while ((temp != NULL) && (temp->delta == 0)) {
        if (current->priority > temp->priority) {
          current = temp;
        }
        temp = temp->next;
      }
      CORE_EXIT_ATOMIC();

      // Check if current periodic timer was delayed more than its actual timeout value
      // and keep it at the head of the timers list if it's the case so that the
      // callback function can be called the number of required time.
      if (current->timeout_periodic != 0u) {
        timeout_temp = current->timeout_periodic;

        periodic_correction = sleeptimer_hal_get_counter() - current->timeout_expected_tc;
        if (periodic_correction > timeout_temp) {
          skip_remove = true;
          current->timeout_expected_tc += current->timeout_periodic;
        }
      }

      // Remove current timer from timer list except if the current timer is a periodic timer
      // that was intentionally kept at the head of the timers list.
      if (skip_remove != true) {
        CORE_ENTER_ATOMIC();
        delta_list_remove_timer(current);
        CORE_EXIT_ATOMIC();
      }

      // Re-insert periodic timer that was previsouly removed from the list
      // and compensate for any deviation from the periodic timer frequency.
      if (current->timeout_periodic != 0u && skip_remove != true) {
        timeout_temp -= periodic_correction;
        EFM_ASSERT(timeout_temp >= 0);
        // Compensate for drift caused by ms to ticks conversion
        if (current->conversion_error > 0) {
          // Increment accumulated error by the ms to ticks conversion error
          current->accumulated_error += current->conversion_error;
          // If the accumulated error exceeds a tick, subtract that tick from the next
          // periodic timer's timeout value.
          if (current->accumulated_error >= 1000) {
            current->accumulated_error -= 1000;
            timeout_temp -= 1;
            current->timeout_expected_tc -= 1;
          }
        }
        CORE_ENTER_ATOMIC();
        delta_list_insert_timer(current, (sl_sleeptimer_tick_count_t)timeout_temp);
        current->timeout_expected_tc += current->timeout_periodic;
        CORE_EXIT_ATOMIC();
      }

      // Save current option flag and the number of timers that expired.
      option_flags = current->option_flags;
      nb_timer_expire++;

      // Call current timer callback function if any.
      if (current->callback != NULL) {
        current->callback(current, current->callback_data);
      }

      CORE_ENTER_ATOMIC();

      // Re-update the list to account for delays during timer's callback.
      update_delta_list();
    }

    // If the only timer expired is the internal Power Manager one,
    // from the Sleeptimer perspective, the system can go back to sleep after the ISR handling.
    sleep_on_isr_exit = false;
    if (nb_timer_expire == 1u) {
      if (option_flags & SLI_SLEEPTIMER_POWER_MANAGER_EARLY_WAKEUP_TIMER_FLAG) {
        sleep_on_isr_exit = true;
      }
    }

    if (timer_head) {
      set_comparator_for_next_timer();
    } else {
      sleeptimer_hal_disable_int(SLEEPTIMER_EVENT_COMP);
    }
    CORE_EXIT_ATOMIC();
  }
}

/*******************************************************************************
 * Timer expiration callback for the delay function.
 *
 * @param handle Pointer to handle to timer.
 * @param data Pointer to delay flag.
 ******************************************************************************/
static void delay_callback(sl_sleeptimer_timer_handle_t *handle,
                           void *data)
{
  volatile bool *wait_flag = (bool *)data;

  (void)handle;  // Unused parameter.

  *wait_flag = false;
}

/*******************************************************************************
 * Inserts a timer in the delta list.
 *
 * @param handle Pointer to handle to timer.
 * @param timeout Timer timeout, in ticks.
 ******************************************************************************/
static void delta_list_insert_timer(sl_sleeptimer_timer_handle_t *handle,
                                    sl_sleeptimer_tick_count_t timeout)
{
  sl_sleeptimer_tick_count_t local_handle_delta = timeout;

#ifdef SL_CATALOG_POWER_MANAGER_PRESENT
  // If Power Manager is present, it's possible that a clock restore is needed right away
  // if we are in the context of a deepsleep and the timeout value is smaller than the restore time.
  // If it's the case, the restore will be started and the timeout value will be updated to match
  // the restore delay.
  if (handle->option_flags == 0) {
    uint32_t wakeup_delay = sli_power_manager_get_restore_delay();

    if (local_handle_delta < wakeup_delay) {
      local_handle_delta = wakeup_delay;
      sli_power_manager_initiate_restore();
    }
  }
#endif

  handle->delta = local_handle_delta;

